In [1]:
import pandas as pd

 - DataFrame에서 특정 열만 선택하여 CSV 파일로 저장하기

In [2]:
df=pd.DataFrame({
    'Name':{0:'Tom',1:'Laura',2:'Kevin',3:'Julia',4:'Jhon'},
    'Gender':{0:'male',1:None,2:'male',3:None,4:'male'},
    'Age':{0:None,1:25,2:30,3:18,4:None}
})

In [3]:
df

    Name Gender   Age
0    Tom   male   NaN
1  Laura   None  25.0
2  Kevin   male  30.0
3  Julia   None  18.0
4   Jhon   male   NaN

In [4]:
df.to_csv('df_to_csv2.csv', columns=['Name','Age'], header=['user name','user age'])

  - DataFrame을 json 파일로 저장하기

In [5]:
df

    Name Gender   Age
0    Tom   male   NaN
1  Laura   None  25.0
2  Kevin   male  30.0
3  Julia   None  18.0
4   Jhon   male   NaN

In [6]:
df.to_json('df_to_json.json')

- excel 파일로 저장하기

    (1) to_excel 함수
        - DataFrame에 저장된 데이터를 excel 파일로 저장
        - [형식] df.to_excel(excel_wirter, sheet_name, header, index)
            - DataFrame 데이터를 excel 파일로 덤프
            - excel_wirter, sheet_name, header, index

In [7]:
df

    Name Gender   Age
0    Tom   male   NaN
1  Laura   None  25.0
2  Kevin   male  30.0
3  Julia   None  18.0
4   Jhon   male   NaN

In [8]:
df.to_excel('df_to_excel.xlsx')

In [9]:
df.set_index('Name',inplace=True)

In [10]:
df

      Gender   Age
Name
Tom     male   NaN
Laura   None  25.0
Kevin   male  30.0
Julia   None  18.0
Jhon    male   NaN

In [11]:
df.to_excel('df_to_excel2.xlsx')

 - 여러개의 DataFrame을 excel 파일에 저장하기
    
    (1) ExcelWriter 함수
        - 여러개의 excel 시트를 갖는 excel 파일 생성
        - pd.ExcelWriter() 객체를 생성한 후, to_excel() 함수를 이용하여 시트를 추가
        - save() 함수를 이용하여 저장
        - [형식] pd.ExcelWriter(path_or_buf)
            - path_or_buf : 파일 또는 파일개체의 이름

In [12]:
df1=pd.DataFrame({
    'Name':{0:'Tom',1:'Laura',2:'Kevin',3:'Julia',4:'Jhon'},
    'Gender':{0:'male',1:None,2:'male',3:None,4:'male'},
    'Age':{0:None,1:25,2:30,3:18,4:None}
})
df2=pd.DataFrame({
    'Name':{0:'Tom2',1:'Laura2',2:'Kevin2',3:'Julia2',4:'Jhon2'},
    'Gender':{0:'male',1:None,2:'male',3:None,4:'male'},
    'Age':{0:None,1:25,2:30,3:18,4:None}
})
print(df1)
print('\n')
print(df2)
excel_writer=pd.ExcelWriter('df_to_excel3.xlsx')
df1.to_excel(excel_writer,sheet_name='info_data1')
df2.to_excel(excel_writer,sheet_name='info_data2')
excel_writer.save()

    Name Gender   Age
0    Tom   male   NaN
1  Laura   None  25.0
2  Kevin   male  30.0
3  Julia   None  18.0
4   Jhon   male   NaN


     Name Gender   Age
0    Tom2   male   NaN
1  Laura2   None  25.0
2  Kevin2   male  30.0
3  Julia2   None  18.0
4   Jhon2   male   NaN